{
    "class_name": "Model",
    "config": {
        "name": "model_26",
        "layers": [
            {
                "name": "input_26",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        6,
                        18
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_26"
                },
                "inbound_nodes": []
            },
            {
                "name": "gru_151",
                "class_name": "GRU",
                "config": {
                    "name": "gru_151",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 256,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.2,
                    "recurrent_dropout": 0.0,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "input_26",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_152",
                "class_name": "GRU",
                "config": {
                    "name": "gru_152",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 128,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.3,
                    "recurrent_dropout": 0.2,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_151",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_153",
                "class_name": "GRU",
                "config": {
                    "name": "gru_153",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 128,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.5,
                    "recurrent_dropout": 0.4,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_152",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_154",
                "class_name": "GRU",
                "config": {
                    "name": "gru_154",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 64,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.5,
                    "recurrent_dropout": 0.3,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_153",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_155",
                "class_name": "GRU",
                "config": {
                    "name": "gru_155",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 64,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.5,
                    "recurrent_dropout": 0.3,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_154",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_156",
                "class_name": "GRU",
                "config": {
                    "name": "gru_156",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": false,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 32,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.3,
                    "recurrent_dropout": 0.3,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_155",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_76",
                "class_name": "Dense",
                "config": {
                    "name": "dense_76",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 6,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_156",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_77",
                "class_name": "Dense",
                "config": {
                    "name": "dense_77",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 6,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_156",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_78",
                "class_name": "Dense",
                "config": {
                    "name": "dense_78",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 6,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_156",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_26",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_76",
                0,
                0
            ],
            [
                "dense_77",
                0,
                0
            ],
            [
                "dense_78",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.1",
    "backend": "tensorflow"
}