{
    "class_name": "Model",
    "config": {
        "name": "model_11",
        "layers": [
            {
                "name": "input_11",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        3,
                        17
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_11"
                },
                "inbound_nodes": []
            },
            {
                "name": "gru_61",
                "class_name": "GRU",
                "config": {
                    "name": "gru_61",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 256,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.2,
                    "recurrent_dropout": 0.0,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "input_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_62",
                "class_name": "GRU",
                "config": {
                    "name": "gru_62",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 128,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.3,
                    "recurrent_dropout": 0.2,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_61",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_63",
                "class_name": "GRU",
                "config": {
                    "name": "gru_63",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 128,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.5,
                    "recurrent_dropout": 0.4,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_62",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_64",
                "class_name": "GRU",
                "config": {
                    "name": "gru_64",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 64,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.5,
                    "recurrent_dropout": 0.3,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_63",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_65",
                "class_name": "GRU",
                "config": {
                    "name": "gru_65",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 64,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.5,
                    "recurrent_dropout": 0.3,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_64",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "gru_66",
                "class_name": "GRU",
                "config": {
                    "name": "gru_66",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": false,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 32,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.3,
                    "recurrent_dropout": 0.3,
                    "implementation": 2,
                    "reset_after": false
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_65",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_11",
                "class_name": "Dense",
                "config": {
                    "name": "dense_11",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "gru_66",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_11",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_11",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.1",
    "backend": "tensorflow"
}